tap "graalvm/tap"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "leoafarias/fvm"
tap "lihaoyun6/tap"
tap "macmade/tap"
tap "minio/stable"
tap "mongodb/brew"
tap "mvndaemon/mvnd"
tap "oven-sh/bun"
tap "pkgxdev/made"
tap "sagernet/sing-box"
tap "tencentcloud/tccli"
tap "tsung-ju/iguanatexmac"
brew "act"
brew "aliyun-cli"
brew "xz"
brew "automake"
brew "sqlite"
brew "bfg"
brew "certbot"
brew "clang-format"
brew "cloc"
brew "cloudflared"
brew "cmake"
brew "ruby"
brew "cocoapods"
brew "evernote-backup"
brew "libarchive"
brew "ffmpeg"
brew "fnm"
brew "gdbm"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "helix"
brew "htop"
brew "hugo"
brew "tcl-tk"
brew "pillow"
brew "jadx"
brew "jq"
brew "juicefs"
brew "kdoctor"
brew "libffi"
brew "libheif"
brew "mackup"
brew "maven"
brew "mongosh"
brew "protobuf"
brew "mosh"
brew "mysql-client"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "ocrmypdf"
brew "openssl@1.1"
brew "pandoc"
brew "pdm"
brew "php"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "pstree"
brew "python@3.11"
brew "ranger"
brew "rclone"
brew "redis"
brew "rsync"
brew "rust"
brew "rustup"
brew "scrcpy"
brew "semgrep"
brew "smartmontools"
brew "starship"
brew "superfile"
brew "tmux"
brew "tokei"
brew "trash"
brew "tree"
brew "typst"
brew "vercel-cli"
brew "watchman"
brew "xcbeautify"
brew "yasm"
brew "zsh"
brew "zx"
brew "gromgit/fuse/ntfs-3g-mac"
brew "gromgit/fuse/s3fs-mac"
brew "leoafarias/fvm/fvm"
brew "minio/stable/minio"
brew "mongodb/brew/mongodb-community"
brew "mvndaemon/mvnd/mvnd"
brew "oven-sh/bun/bun"
brew "pkgxdev/made/pkgx"
brew "tencentcloud/tccli/tccli"
cask "alt-tab"
cask "applite"
cask "bruno"
cask "copilot-for-xcode"
cask "cursor"
cask "font-victor-mono-nerd-font"
cask "git-credential-manager"
cask "iguanatexmac"
cask "iina"
cask "iterm2"
cask "keycastr"
cask "latexit-metadata"
cask "macfuse"
cask "mongodb-compass"
cask "netnewswire"
cask "obs"
cask "orbstack"
cask "qdelayer"
cask "raycast"
cask "slack"
cask "stats"
cask "temurin@17"
cask "trunk-io"
cask "vlc"
cask "warp"
cask "zerotier-one"
vscode "affenwiesel.matlab-formatter"
vscode "akamud.vscode-theme-onedark"
vscode "akamud.vscode-theme-onelight"
vscode "akirarika.vscode-hbuilder-green-light-theme"
vscode "alexisvt.flutter-snippets"
vscode "alibaba-cloud.tongyi-lingma"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "amodio.tsl-problem-matcher"
vscode "asf.apache-netbeans-java"
vscode "caponetto.vscode-diff-viewer"
vscode "chaseadamsio.vscode-theme-neon-night"
vscode "christian-kohler.path-intellisense"
vscode "codespaces-contrib.codeswing"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-redis-client"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emeryberger.scalene"
vscode "esbenp.prettier-vscode"
vscode "everspace.rightclick-git"
vscode "felixangelov.bloc"
vscode "fireplusteam.vscode-ios"
vscode "flutterbricksproductions.flutterbricks"
vscode "fortran-lang.linter-gfortran"
vscode "foxundermoon.shell-format"
vscode "gera2ld.markmap-vscode"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-codeql"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitworktrees.git-worktrees"
vscode "golang.go"
vscode "hbenl.vscode-test-explorer"
vscode "hirse.vscode-ungit"
vscode "imgcook.imgcook"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.winteriscoming"
vscode "k--kato.intellij-idea-keybindings"
vscode "kylebarron.stata-enhanced"
vscode "leetcode.vscode-leetcode"
vscode "lextudio.restructuredtext"
vscode "lextudio.restructuredtext-pack"
vscode "lhl2617.latex-js-preview"
vscode "lninl.theme-hbuilderx-soft-green-light"
vscode "marp-team.marp-vscode"
vscode "marscode.marscode-extension"
vscode "mathpix.vscode-mathpix-markdown"
vscode "mathworks.language-matlab"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.theme-markdownkit"
vscode "ms-vsliveshare.vsliveshare"
vscode "myriad-dreamin.tinymist"
vscode "nash.awesome-flutter-snippets"
vscode "natizyskunk.sftp"
vscode "nvarner.typst-lsp"
vscode "oderwat.indent-rainbow"
vscode "philipbe.theme-gray-matter"
vscode "piersdeseilligny.betterfountain"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "pnp.polacode"
vscode "pranaygp.vscode-css-peek"
vscode "quarto.quarto"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "ryu1kn.partial-diff"
vscode "seanwu.vscode-qt-for-python"
vscode "seaube.clangformat"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sonarsource.sonarlint-vscode"
vscode "sourcegraph.sourcegraph"
vscode "sswg.swift-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "trond-snekvik.simple-rst"
vscode "trunk.io"
vscode "twxs.cmake"
vscode "unbug.codelf"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "valentjn.vscode-ltex"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "waderyan.gitblame"
vscode "wmaurer.vscode-jumpy"
vscode "wya-lsp.wls"
vscode "xaver.clang-format"
vscode "yzhang.markdown-all-in-one"
